// src/i18n/ar.js
import dawha from "@/assets/images/dawha.jpeg";
import AIU from "@/assets/images/AIU.jpg";
import bba from "@/assets/images/baa.png";
import sharfto from "@/assets/images/logo.png";
export default {
  sidebar: {
    name: "ياسين طعمة",
    title: "مطور واجهات",
    bio: "مطور واجهات أمامية، أمتلك خبرة واسعة في استخدام إطاري Vue.js و Nuxt.js، مع إتقان Pinia لإدارة الحالة، وAxios للتفاعل مع واجهات برمجة التطبيقات (API). كما أجيد العمل باستخدام Sass وBootstrap لتنسيق الواجهات، وأعتمد على GitLab لإدارة الأكواد والمشاريع بكفاءة.",
    sections: {
      intro: "نبذة عني",
      education: "التعليم",
      skills: "المهارات",
      languages: "اللغات",
      experience: "الخبرات",
      portfolio: "المعرض",
      achievements: "الإنجازات",
      contact: "التواصل",
    },
  },
  intro: {
    greeting: "مرحبًا بك في",
    greetingg: "سيرتي الذاتية!",
    bio: "أنا مطور واجهات أمامية شغوف، متخصص في Vue.js وأطر JavaScript الحديثة. أركز على إنشاء واجهات متجاوبة وسهلة الاستخدام، وأسعى إلى تطوير تطبيقات تجمع بين الأداء الوظيفي والجاذبية البصرية.",
    contactMe: "تواصل معي",
    viewWork: "عرض أعمالي",
  },
  educations: {
    title: "التعليم",
    items: [
      {
        id: 1,
        degree: "المدرسة الإعدادية",
        institution: "مدرسة الدوحة الخاصة",
        location: "الشارقة، الإمارات العربية المتحدة",
        period: "٢٠١٥ - ٢٠١٧",
        description:
          "اشتركت في منهج دراسي واسع يغطي مواد مثل الرياضيات والعلوم والتاريخ والأدب. شاركت بنشاط في الرياضة ومختلف الأنشطة الثقافية، مما طور مهارات العمل الجماعي والقيادة.",
        logo: dawha,
      },
      {
        id: 2,
        degree: "المدرسة الثانوية",
        institution: "مدرسة بناة الأجيال الخاصة",
        location: "دمشق، سوريا",
        period: "٢٠١٧ - ٢٠٢٠",
        description:
          "أكملت برنامجًا أكاديميًا شاملًا مع تركيز قوي على العلوم والرياضيات. شاركت في العديد من الفعاليات والمشاريع المدرسية التي عززت العمل الجماعي ومهارات التواصل.",
        logo: bba,
      },
      {
        id: 3,
        degree: "بكالوريوس",
        institution: "الجامعة العربية الدولية",
        location: "دمشق، سوريا",
        period: "٢٠٢٠ - ٢٠٢٥",
        description:
          "حصلت على درجة البكالوريوس في تكنولوجيا المعلومات في الجامعة العربية الدولية مع تخصص في تطوير البرمجيات. طورت مهارات قوية في البرمجة، وتصميم الأنظمة، وحل المشكلات. شاركت في مشاريع عززت الخبرة التقنية، والعمل الجماعي، والتفكير التحليلي.",
        logo: AIU,
      },
    ],
  },
  skills: {
    title: "المهارات",
    description:
      "فيما يلي المهارات التقنية التي اكتسبتها على مر السنين، والتي تمكنني من بناء تطبيقات ويب عالية الجودة وتقديم خدمات قيمة.",
    programming: "لغات البرمجة",
    tools: "الأدوات والتقنيات",
    languages: "اللغات",
  },
  languages: {
    title: "اللغات",
    description: "اللغات التي أتحدثها بطلاقة وأستخدمها في عملي المهني.",
    items: [
      {
        name: "العربية",
        level: "اللغة الأم",
        proficiency: 100,
        icon: "fas fa-language",
        description: "اللغة الأم مع مهارات ممتازة في القراءة والكتابة والتحدث.",
      },
      {
        name: "الإنجليزية",
        level: "بطلاقة",
        proficiency: 90,
        icon: "fas fa-language",
        description: "إجادة مهنية عالية في القراءة والكتابة والتحدث.",
      },
    ],
  },

  experience: {
    title: "الخبرة",
    items: [
      {
        degree: "مطوّر واجهات أمامية",
        institution: "شرفتو",
        description:
          "تصميم وتطوير تطبيقات ويب تفاعلية باستخدام إطار عمل حديث للواجهات الأمامية، مما يضمن تجربة مستخدم سلسة وبديهية. بناء هيكلية واجهة أمامية قابلة للتطوير لتعزيز أداء الموقع. تحسين كفاءة الموقع من خلال تقليل عدد الطلبات وزيادة سرعة التحميل.",
        tags: [
          "Vue.js",
          "Nuxt.js",
          "vuex",
          "Pinia",
          "Sass",
          "Bootstrap",
          "Gitlab",
        ],
        period: "2023 - 2024",
        logo: sharfto,
      },
    ],
  },

  portfolio: {
    title: "المعرض",
    viewProject: "عرض المشروع",
    description:
      "مجموعة من مشاريعي الحديثة التي تُبرز مهاراتي في تطوير تطبيقات ويب تفاعلية ومتجاوبة.",
  },
  achievements: {
    title: "الإنجازات",
    date: "التاريخ",
  },
  contact: {
    title: "التواصل",
    description: "هل لديك سؤال او ترغب في التعاون؟ لا تتردد في الاتصال بي!",
    name: "الاسم",
    email: "البريد الإلكتروني",
    subject: "الموضوع",
    message: "الرسالة",
    send: "إرسال الرسالة",
    sending: "جاري الإرسال...",
    yourName: "اسمك",
    yourMessage: "رسالتك",
    yourEmail: "بريدك الإلكتروني",
    success: "تم إرسال رسالتك بنجاح!",
    error: "حدث خطأ أثناء إرسال الرسالة. يرجى المحاولة مرة أخرى.",
  },
};
